; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v1 - type_3 ?v7 - type_1)
 	      (pred_2 ?v8 - object ?v7 - type_1)
	      (pred_3 ?v1 - type_3 ?v6 - type_2)
	      (pred_1 ?v1 - type_3 ?v8 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v5 ?v3 - type_1)
       :precondition (and  (pred_4 ?v1 ?v5))
       :effect (and  (pred_4 ?v1 ?v3)
		     (not (pred_4 ?v1 ?v5))))

   (:action op_1
       :parameters (?v1 - type_3 ?v2 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v4) (pred_4 ?v1 ?v4) (pred_3 ?v1 ?v6))
       :effect (and (pred_1 ?v1 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v4)) 
		    (not (pred_3 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_3 ?v2 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v2 ?v6) (pred_4 ?v1 ?v4))
       :effect (and (pred_2 ?v2 ?v4)
		    (pred_3 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v2 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_06 obj_05 - type_2
obj_08 obj_03 obj_02 obj_04 - type_1
obj_07 obj_09 obj_10 - object)
(:init
(pred_4 obj_01 obj_04)
(pred_3 obj_01 obj_06)
(pred_3 obj_01 obj_05)
(pred_2 obj_07 obj_08)
(pred_2 obj_09 obj_04)
(pred_2 obj_10 obj_02)
)
(:goal
(and
(pred_2 obj_07 obj_03)
(pred_2 obj_09 obj_04)
(pred_2 obj_10 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_01 ?b obj_06))))
)
)

; plan
1. (op_3 obj_01 obj_04 obj_02)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_02)
   goals met: 1 of 3
2. (op_1 obj_01 obj_10 obj_02 obj_05)
   deleted: (pred_2 obj_10 obj_02) (pred_3 obj_01 obj_05)
   added: (pred_1 obj_01 obj_10 obj_05)
   goals met: 1 of 3
3. (op_3 obj_01 obj_02 obj_03)
   deleted: (pred_4 obj_01 obj_02)
   added: (pred_4 obj_01 obj_03)
   goals met: 1 of 3
4. (op_3 obj_01 obj_03 obj_04)
   deleted: (pred_4 obj_01 obj_03)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 3
5. (op_2 obj_01 obj_10 obj_04 obj_05)
   deleted: (pred_1 obj_01 obj_10 obj_05)
   added: (pred_2 obj_10 obj_04) (pred_3 obj_01 obj_05)
   goals met: 2 of 3
6. (op_3 obj_01 obj_04 obj_03)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_03)
   goals met: 2 of 3
7. (op_3 obj_01 obj_03 obj_08)
   deleted: (pred_4 obj_01 obj_03)
   added: (pred_4 obj_01 obj_08)
   goals met: 2 of 3
8. (op_1 obj_01 obj_07 obj_08 obj_05)
   deleted: (pred_2 obj_07 obj_08) (pred_3 obj_01 obj_05)
   added: (pred_1 obj_01 obj_07 obj_05)
   goals met: 2 of 3
9. (op_3 obj_01 obj_08 obj_03)
   deleted: (pred_4 obj_01 obj_08)
   added: (pred_4 obj_01 obj_03)
   goals met: 2 of 3
10. (op_2 obj_01 obj_07 obj_03 obj_05)
   deleted: (pred_1 obj_01 obj_07 obj_05)
   added: (pred_2 obj_07 obj_03) (pred_3 obj_01 obj_05)
   goals met: 3 of 3
